Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: يطاف عليهم بصحاف من ذهب وأكواب وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون
en: To them will be passed round, dishes and goblets of gold: there will be there all that the souls could desire, all that their eyes could delight in: and ye shall abide therein (for eye).

source: وتلك الجنة التي أورثتموها بما كنتم تعملون
en: Such will be the Garden of which ye are made heirs for your (good) deeds (in life).

source: لكم فيها فاكهة كثيرة منها تأكلون
en: Ye shall have therein abundance of fruit, from which ye shall have satisfaction.

source: إن المجرمين في عذاب جهنم خالدون
en: The sinners will be in the Punishment of Hell, to dwell therein (for aye):

source: لا يفتر عنهم وهم فيه مبلسون
en: Nowise will the (Punishment) be lightened for them, and in despair will they be there overwhelmed.

source: وما ظلمناهم ولكن كانوا هم الظالمين
en: Nowise shall We be unjust to them: but it is they who have been unjust themselves.

source: ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون
en: They will cry: "O Malik! would that thy Lord put an end to us!" He will say, "Nay, but ye shall abide!"

source: لقد جئناكم بالحق ولكن أكثركم للحق كارهون
en: Verily We have brought the Truth to you: but most of you have a hatred for Truth.

source: أم أبرموا أمرا فإنا مبرمون
en: What! have they settled some plan (among themselves)? But it is We Who settle things.

source: أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون
en: Or do they think that We hear not their secrets and their private counsels? Indeed (We do), and Our messengers are by them, to record.

source: قل إن كان للرحمن ولد فأنا أول العابدين
en: Say: "If (Allah) Most Gracious had a son, I would be the first to worship."

source: سبحان رب السماوات والأرض رب العرش عما يصفون
en: Glory to the Lord of the heavens and the earth, the Lord of the Throne (of Authority)! (He is free) from the things they attribute (to him)!

source: فذرهم يخوضوا ويلعبوا حتى يلاقوا يومهم الذي يوعدون
en: So leave them to babble and play (with vanities) until they meet that Day of theirs, which they have been promised.

source: وهو الذي في السماء إله وفي الأرض إله وهو الحكيم العليم
en: It is He Who is Allah in heaven and Allah on earth; and He is full of Wisdom and Knowledge.

source: وتبارك الذي له ملك السماوات والأرض وما بينهما وعنده علم الساعة وإليه ترجعون
en: And blessed is He to Whom belongs the dominion of the heavens and the earth, and all between them: with Him is the Knowledge of the Hour (of Judgment): and to Him shall ye be brought back.

source: ولا يملك الذين يدعون من دونه الشفاعة إلا من شهد بالحق وهم يعلمون
en: And those whom they invoke besides Allah have no power of intercession;- only he who bears witness to the Truth, and they know (him).

source: ولئن سألتهم من خلقهم ليقولن الله فأنى يؤفكون
en: If thou ask them, who created them, they will certainly say, Allah: How then are they deluded away (from the Truth)?

source: وقيله يا رب إن هؤلاء قوم لا يؤمنون
en: (Allah has knowledge) of the (Prophet's) cry, "O my Lord! Truly these are people who will not believe!"

source: فاصفح عنهم وقل سلام فسوف يعلمون
en: But turn away from them, and say "Peace!" But soon shall they know!

source: إنا أنزلناه في ليلة مباركة إنا كنا منذرين
en: We sent it down during a Blessed Night: for We (ever) wish to warn (against Evil).

source: فيها يفرق كل أمر حكيم
en: In the (Night) is made distinct every affair of wisdom,

source: أمرا من عندنا إنا كنا مرسلين
en: By command, from Our Presence. For We (ever) send (revelations),

source: رحمة من ربك إنه هو السميع العليم
en: As Mercy from thy Lord: for He hears and knows (all things);

source: رب السماوات والأرض وما بينهما إن كنتم موقنين
en: The Lord of the heavens and the earth and all between them, if ye (but) have an assured faith.

source: لا إله إلا هو يحيي ويميت ربكم ورب آبائكم الأولين
en: There is no god but He: It is He Who gives life and gives death,- The Lord and Cherisher to you and your earliest ancestors.

source: بل هم في شك يلعبون
en: Yet they play about in doubt.

source: فارتقب يوم تأتي السماء بدخان مبين
en: Then watch thou for the Day that the sky will bring forth a kind of smoke (or mist) plainly visible,

source: يغشى الناس هذا عذاب أليم
en: Enveloping the people: this will be a Penalty Grievous.

source: ربنا اكشف عنا العذاب إنا مؤمنون
en: (They will say:) "Our Lord! remove the Penalty from us, for we do really believe!"

source: أنى لهم الذكرى وقد جاءهم رسول مبين
en: How shall the message be (effectual) for them, seeing that an Messenger explaining things clearly has (already) come to them,-

source: ثم تولوا عنه وقالوا معلم مجنون
en: Yet they turn away from him and say: "Tutored (by others), a man possessed!"

source: إنا كاشفو العذاب قليلا إنكم عائدون
en: We shall indeed remove the Penalty for a while, (but) truly ye will revert (to your ways).

source: يوم نبطش البطشة الكبرى إنا منتقمون
en: One day We shall seize you with a mighty onslaught: We will indeed (then) exact Retribution!

source: ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم
en: We did, before them, try the people of Pharaoh: there came to them a messenger most honourable,

source: أن أدوا إلي عباد الله إني لكم رسول أمين
en: Saying: "Restore to me the Servants of Allah: I am to you an messenger worthy of all trust;

source: وأن لا تعلوا على الله إني آتيكم بسلطان مبين
en: "And be not arrogant as against Allah: for I come to you with authority manifest.

source: وإني عذت بربي وربكم أن ترجمون
en: "For me, I have sought safety with my Lord and your Lord, against your injuring me.

source: وإن لم تؤمنوا لي فاعتزلون
en: "If ye believe me not, at least keep yourselves away from me."

source: فدعا ربه أن هؤلاء قوم مجرمون
en: (But they were aggressive:) then he cried to his Lord: "These are indeed a people given to sin."

source: فأسر بعبادي ليلا إنكم متبعون
en: (The reply came:) "March forth with My Servants by night: for ye are sure to be pursued.

source: واترك البحر رهوا إنهم جند مغرقون
en: "And leave the sea as a furrow (divided): for they are a host (destined) to be drowned."

source: كم تركوا من جنات وعيون
en: How many were the gardens and springs they left behind,

source: وزروع ومقام كريم
en: And corn-fields and noble buildings,

source: ونعمة كانوا فيها فاكهين
en: And wealth (and conveniences of life), wherein they had taken such delight!

source: كذلك وأورثناها قوما آخرين
en: Thus (was their end)! And We made other people inherit (those things)!

source: فما بكت عليهم السماء والأرض وما كانوا منظرين
en: And neither heaven nor earth shed a tear over them: nor were they given a respite (again).

source: ولقد نجينا بني إسرائيل من العذاب المهين
en: We did deliver aforetime the Children of Israel from humiliating Punishment,

source: من فرعون إنه كان عاليا من المسرفين
en: Inflicted by Pharaoh, for he was arrogant (even) among inordinate transgressors.

source: ولقد اخترناهم على علم على العالمين
en: And We chose them aforetime above the nations, knowingly,

source: وآتيناهم من الآيات ما فيه بلاء مبين
en: And granted them Signs in which there was a manifest trial

source: إن هؤلاء ليقولون
en: As to these (Quraish), they say forsooth:

source: إن هي إلا موتتنا الأولى وما نحن بمنشرين
en: "There is nothing beyond our first death, and we shall not be raised again.

source: فأتوا بآبائنا إن كنتم صادقين
en: "Then bring (back) our forefathers, if what ye say is true!"

source: أهم خير أم قوم تبع والذين من قبلهم أهلكناهم إنهم كانوا مجرمين
en: What! Are they better than the people of Tubba and those who were before them? We destroyed them because they were guilty of sin.

source: وما خلقنا السماوات والأرض وما بينهما لاعبين
en: We created not the heavens, the earth, and all between them, merely in (idle) sport:

source: ما خلقناهما إلا بالحق ولكن أكثرهم لا يعلمون
en: We created them not except for just ends: but most of them do not understand.

source: إن يوم الفصل ميقاتهم أجمعين
en: Verily the Day of sorting out is the time appointed for all of them,-

source: يوم لا يغني مولى عن مولى شيئا ولا هم ينصرون
en: The Day when no protector can avail his client in aught, and no help can they receive,

source: إلا من رحم الله إنه هو العزيز الرحيم
en: Except such as receive Allah's Mercy: for He is Exalted in Might, Most Merciful.

source: إن شجرت الزقوم
en: Verily the tree of Zaqqum

source: طعام الأثيم
en: Will be the food of the Sinful,-

source: كالمهل يغلي في البطون
en: Like molten brass; it will boil in their insides.

source: كغلي الحميم
en: Like the boiling of scalding water.

source: خذوه فاعتلوه إلى سواء الجحيم
en: (A voice will cry: "Seize ye him and drag him into the midst of the Blazing Fire!

source: ثم صبوا فوق رأسه من عذاب الحميم
en: "Then pour over his head the Penalty of Boiling Water,

source: ذق إنك أنت العزيز الكريم
en: "Taste thou (this)! Truly wast thou mighty, full of honour!

source: إن هذا ما كنتم به تمترون
en: "Truly this is what ye used to doubt!"

source: إن المتقين في مقام أمين
en: As to the Righteous (they will be) in a position of Security,

source: يلبسون من سندس وإستبرق متقابلين
en: Dressed in fine silk and in rich brocade, they will face each other;

source: كذلك وزوجناهم بحور عين
en: So; and We shall join them to fair women with beautiful, big, and lustrous eyes.

source: يدعون فيها بكل فاكهة آمنين
en: There can they call for every kind of fruit in peace and security;

source: لا يذوقون فيها الموت إلا الموتة الأولى ووقاهم عذاب الجحيم
en: Nor will they there taste Death, except the first death; and He will preserve them from the Penalty of the Blazing Fire,-

source: فضلا من ربك ذلك هو الفوز العظيم
en: As a Bounty from thy Lord! that will be the supreme achievement!

source: فإنما يسرناه بلسانك لعلهم يتذكرون
en: Verily, We have made this (Qur'an) easy, in thy tongue, in order that they may give heed.

source: فارتقب إنهم مرتقبون
en: So wait thou and watch; for they (too) are waiting.

source: إن في السماوات والأرض لآيات للمؤمنين
en: Verily in the heavens and the earth, are Signs for those who believe.

source: وفي خلقكم وما يبث من دابة آيات لقوم يوقنون
en: And in the creation of yourselves and the fact that animals are scattered (through the earth), are Signs for those of assured Faith.

source: واختلاف الليل والنهار وما أنزل الله من السماء من رزق فأحيا به الأرض بعد موتها وتصريف الرياح آيات لقوم يعقلون
en: And in the alternation of Night and Day, and the fact that Allah sends down Sustenance from the sky, and revives therewith the earth after its death, and in the change of the winds,- are Signs for those that are wise.

source: تلك آيات الله نتلوها عليك بالحق فبأي حديث بعد الله وآياته يؤمنون
en: Such are the Signs of Allah, which We rehearse to thee in Truth; then in what exposition will they believe after (rejecting) Allah and His Signs?

source: ويل لكل أفاك أثيم
en: Woe to each sinful dealer in Falsehoods:

source: يسمع آيات الله تتلى عليه ثم يصر مستكبرا كأن لم يسمعها فبشره بعذاب أليم
en: He hears the Signs of Allah rehearsed to him, yet is obstinate and lofty, as if he had not heard them: then announce to him a Penalty Grievous!

source: وإذا علم من آياتنا شيئا اتخذها هزوا أولئك لهم عذاب مهين
en: And when he learns something of Our Signs, he takes them in jest: for such there will be a humiliating Penalty.

source: من ورائهم جهنم ولا يغني عنهم ما كسبوا شيئا ولا ما اتخذوا من دون الله أولياء ولهم عذاب عظيم
en: In front of them is Hell: and of no profit to them is anything they may have earned, nor any protectors they may have taken to themselves besides Allah: for them is a tremendous Penalty.

source: هذا هدى والذين كفروا بآيات ربهم لهم عذاب من رجز أليم
en: This is (true) Guidance and for those who reject the Signs of their Lord, is a grievous Penalty of abomination.

source: الله الذي سخر لكم البحر لتجري الفلك فيه بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: It is Allah Who has subjected the sea to you, that ships may sail through it by His command, that ye may seek of his Bounty, and that ye may be grateful.

source: وسخر لكم ما في السماوات وما في الأرض جميعا منه إن في ذلك لآيات لقوم يتفكرون
en: And He has subjected to you, as from Him, all that is in the heavens and on earth: Behold, in that are Signs indeed for those who reflect.

source: قل للذين آمنوا يغفروا للذين لا يرجون أيام الله ليجزي قوما بما كانوا يكسبون
en: Tell those who believe, to forgive those who do not look forward to the Days of Allah: It is for Him to recompense (for good or ill) each People according to what they have earned.

source: من عمل صالحا فلنفسه ومن أساء فعليها ثم إلى ربكم ترجعون
en: If any one does a righteous deed, it ensures to the benefit of his own soul; if he does evil, it works against (his own soul). In the end will ye (all) be brought back to your Lord.

source: ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين
en: We did aforetime grant to the Children of Israel the Book the Power of Command, and Prophethood; We gave them, for Sustenance, things good and pure; and We favoured them above the nations.

source: وآتيناهم بينات من الأمر فما اختلفوا إلا من بعد ما جاءهم العلم بغيا بينهم إن ربك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون
en: And We granted them Clear Signs in affairs (of Religion): it was only after knowledge had been granted to them that they fell into schisms, through insolent envy among themselves. Verily thy Lord will judge between them on the Day of Judgment as to those matters in which they set up differences.

source: ثم جعلناك على شريعة من الأمر فاتبعها ولا تتبع أهواء الذين لا يعلمون
en: Then We put thee on the (right) Way of Religion: so follow thou that (Way), and follow not the desires of those who know not.

source: إنهم لن يغنوا عنك من الله شيئا وإن الظالمين بعضهم أولياء بعض والله ولي المتقين
en: They will be of no use to thee in the sight of Allah: it is only Wrong-doers (that stand as) protectors, one to another: but Allah is the Protector of the Righteous.

source: هذا بصائر للناس وهدى ورحمة لقوم يوقنون
en: These are clear evidences to men and a Guidance and Mercy to those of assured Faith.

source: أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون
en: What! Do those who seek after evil ways think that We shall hold them equal with those who believe and do righteous deeds,- that equal will be their life and their death? Ill is the judgment that they make.

source: وخلق الله السماوات والأرض بالحق ولتجزى كل نفس بما كسبت وهم لا يظلمون
en: Allah created the heavens and the earth for just ends, and in order that each soul may find the recompense of what it has earned, and none of them be wronged.

source: أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة فمن يهديه من بعد الله أفلا تذكرون
en: Then seest thou such a one as takes as his god his own vain desire? Allah has, knowing (him as such), left him astray, and sealed his hearing and his heart (and understanding), and put a cover on his sight. Who, then, will guide him after Allah (has withdrawn Guidance)? Will ye not then receive admonition?

source: وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا وما يهلكنا إلا الدهر وما لهم بذلك من علم إن هم إلا يظنون
en: And they say: "What is there but our life in this world? We shall die and we live, and nothing but time can destroy us." But of that they have no knowledge: they merely conjecture:

source: وإذا تتلى عليهم آياتنا بينات ما كان حجتهم إلا أن قالوا ائتوا بآبائنا إن كنتم صادقين
en: And when Our Clear Signs are rehearsed to them their argument is nothing but this: They say, "Bring (back) our forefathers, if what ye say is true!"

source: قل الله يحييكم ثم يميتكم ثم يجمعكم إلى يوم القيامة لا ريب فيه ولكن أكثر الناس لا يعلمون
en: Say: "It is Allah Who gives you life, then gives you death; then He will gather you together for the Day of Judgment about which there is no doubt": But most men do not understand.

source: ولله ملك السماوات والأرض ويوم تقوم الساعة يومئذ يخسر المبطلون
en: To Allah belongs the dominion of the heavens and the earth, and the Day that the Hour of Judgment is established,- that Day will the dealers in Falsehood perish!

source: وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون
en: And thou wilt see every sect bowing the knee: Every sect will be called to its Record: "This Day shall ye be recompensed for all that ye did!

source: هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون
en: "This Our Record speaks about you with truth: For We were wont to put on Record all that ye did."

source: فأما الذين آمنوا وعملوا الصالحات فيدخلهم ربهم في رحمته ذلك هو الفوز المبين
en: Then, as to those who believed and did righteous deeds, their Lord will admit them to His Mercy that will be the achievement for all to see.

source: وأما الذين كفروا أفلم تكن آياتي تتلى عليكم فاستكبرتم وكنتم قوما مجرمين
en: But as to those who rejected Allah, (to them will be said): "Were not Our Signs rehearsed to you? But ye were arrogant, and were a people given to sin!

source: وإذا قيل إن وعد الله حق والساعة لا ريب فيها قلتم ما ندري ما الساعة إن نظن إلا ظنا وما نحن بمستيقنين
en: "And when it was said that the promise of Allah was true, and that the Hour- there was no doubt about its (coming), ye used to say, 'We know not what is the hour: we only think it is an idea, and we have no firm assurance.'"

source: وبدا لهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: Then will appear to them the evil (fruits) of what they did, and they will be completely encircled by that which they used to mock at!

source: وقيل اليوم ننساكم كما نسيتم لقاء يومكم هذا ومأواكم النار وما لكم من ناصرين
en: It will also be said: "This Day We will forget you as ye forgot the meeting of this Day of yours! and your abode is the Fire, and no helpers have ye!

source: ذلكم بأنكم اتخذتم آيات الله هزوا وغرتكم الحياة الدنيا فاليوم لا يخرجون منها ولا هم يستعتبون
en: "This, because ye used to take the Signs of Allah in jest, and the life of the world deceived you:" (From) that Day, therefore, they shall not be taken out thence, nor shall they be received into Grace.

source: فلله الحمد رب السماوات ورب الأرض رب العالمين
en: Then Praise be to Allah, Lord of the heavens and Lord of the earth,- Lord and Cherisher of all the Worlds!

source: وله الكبرياء في السماوات والأرض وهو العزيز الحكيم
en: To Him be glory throughout the heavens and the earth: and He is Exalted in Power, Full of Wisdom!

source: ما خلقنا السماوات والأرض وما بينهما إلا بالحق وأجل مسمى والذين كفروا عما أنذروا معرضون
en: We created not the heavens and the earth and all between them but for just ends, and for a Term Appointed: But those who reject Faith turn away from that whereof they are warned.

source: قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات ائتوني بكتاب من قبل هذا أو أثارة من علم إن كنتم صادقين
en: Say: "Do ye see what it is ye invoke besides Allah? Show me what it is they have created on earth, or have they a share in the heavens bring me a book (revealed) before this, or any remnant of knowledge (ye may have), if ye are telling the truth!

source: ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون
en: And who is more astray than one who invokes besides Allah, such as will not answer him to the Day of Judgment, and who (in fact) are unconscious of their call (to them)?

source: وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين
en: And when mankind are gathered together (at the Resurrection), they will be hostile to them and reject their worship (altogether)!

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للحق لما جاءهم هذا سحر مبين
en: When Our Clear Signs are rehearsed to them, the Unbelievers say, of the Truth when it comes to them: "This is evident sorcery!"

source: أم يقولون افتراه قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم
en: Or do they say, "He has forged it"? Say: "Had I forged it, then can ye obtain no single (blessing) for me from Allah. He knows best of that whereof ye talk (so glibly)! Enough is He for a witness between me and you! And he is Oft-Forgiving, Most Merciful."

source: قل ما كنت بدعا من الرسل وما أدري ما يفعل بي ولا بكم إن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين
en: Say: "I am no bringer of new-fangled doctrine among the messengers, nor do I know what will be done with me or with you. I follow but that which is revealed to me by inspiration; I am but a Warner open and clear."

source: قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين
en: Say: "See ye? If (this teaching) be from Allah, and ye reject it, and a witness from among the Children of Israel testifies to its similarity (with earlier scripture), and has believed while ye are arrogant, (how unjust ye are!) truly, Allah guides not a people unjust."

source: وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه وإذ لم يهتدوا به فسيقولون هذا إفك قديم
en: The Unbelievers say of those who believe: "If (this Message) were a good thing, (such men) would not have gone to it first, before us!" And seeing that they guide not themselves thereby, they will say, "this is an (old,) falsehood!"

source: ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسانا عربيا لينذر الذين ظلموا وبشرى للمحسنين
en: And before this, was the Book of Moses as a guide and a mercy: And this Book confirms (it) in the Arabic tongue; to admonish the unjust, and as Glad Tidings to those who do right.

source: إن الذين قالوا ربنا الله ثم استقاموا فلا خوف عليهم ولا هم يحزنون
en: Verily those who say, "Our Lord is Allah," and remain firm (on that Path),- on them shall be no fear, nor shall they grieve.

source: أولئك أصحاب الجنة خالدين فيها جزاء بما كانوا يعملون
en: Such shall be Companions of the Gardens, dwelling therein (for aye): a recompense for their (good) deeds.

source: ووصينا الإنسان بوالديه إحسانا حملته أمه كرها ووضعته كرها وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين
en: We have enjoined on man kindness to his parents: In pain did his mother bear him, and in pain did she give him birth. The carrying of the (child) to his weaning is (a period of) thirty months. At length, when he reaches the age of full strength and attains forty years, he says, "O my Lord! Grant me that I may be grateful for Thy favour which Thou has bestowed upon me, and upon both my parents, and that I may work righteousness such as Thou mayest approve; and be gracious to me in my issue. Truly have I turned to Thee and truly do I bow (to Thee) in Islam."

source: أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون
en: Such are they from whom We shall accept the best of their deeds and pass by their ill deeds: (They shall be) among the Companions of the Garden: a promise! of truth, which was made to them (in this life).

source: والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين
en: But (there is one) who says to his parents, "Fie on you! Do ye hold out the promise to me that I shall be raised up, even though generations have passed before me (without rising again)?" And they two seek Allah's aid, (and rebuke the son): "Woe to thee! Have faith! for the promise of Allah is true." But he says, "This is nothing but tales of the ancients!"

source: أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: Such are they against whom is proved the sentence among the previous generations of Jinns and men, that have passed away; for they will be (utterly) lost.
